Res-firecracker-random-in4-v8/firecracker_t_4_c_6_frontVcpu_6_wrkVcpu_1/wrk.txt
Running 1m test @ http://frontend:5000
  4 threads and 6 connections
  Thread calibration: mean lat.: 5056.243ms, rate sampling interval: 17956ms
  Thread calibration: mean lat.: 5059.381ms, rate sampling interval: 17825ms
  Thread calibration: mean lat.: 5038.392ms, rate sampling interval: 17809ms
  Thread calibration: mean lat.: 5065.445ms, rate sampling interval: 17924ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    31.22s    12.34s    0.93m    58.66%
    Req/Sec   273.88      2.57   276.00     87.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   27.41s 
 75.000%   42.40s 
 90.000%   48.96s 
 99.000%    0.93m 
 99.900%    0.95m 
 99.990%    0.96m 
 99.999%    0.96m 
100.000%    0.96m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9928.703     0.000000            4         1.00
   14884.863     0.100000         5498         1.11
   19759.103     0.200000        10984         1.25
   24641.535     0.300000        16490         1.43
   26476.543     0.400000        21989         1.67
   27410.431     0.500000        27498         2.00
   29736.959     0.550000        30212         2.22
   33046.527     0.600000        32956         2.50
   36208.639     0.650000        35721         2.86
   39321.599     0.700000        38456         3.33
   42401.791     0.750000        41212         4.00
   43974.655     0.775000        42576         4.44
   45547.519     0.800000        43941         5.00
   46628.863     0.825000        45312         5.71
   47513.599     0.850000        46743         6.67
   48234.495     0.875000        48074         8.00
   48627.711     0.887500        48792         8.89
   48955.391     0.900000        49427        10.00
   49414.143     0.912500        50169        11.43
   49840.127     0.925000        50835        13.33
   50266.111     0.937500        51505        16.00
   50495.487     0.943750        51883        17.78
   50692.095     0.950000        52221        20.00
   50888.703     0.956250        52517        22.86
   51183.615     0.962500        52867        26.67
   51642.367     0.968750        53210        32.00
   52166.655     0.971875        53379        35.56
   52789.247     0.975000        53547        40.00
   53444.607     0.978125        53724        45.71
   54034.431     0.981250        53892        53.33
   54689.791     0.984375        54070        64.00
   54984.703     0.985938        54151        71.11
   55181.311     0.987500        54242        80.00
   55508.991     0.989062        54324        91.43
   55803.903     0.990625        54405       106.67
   56131.583     0.992188        54493       128.00
   56295.423     0.992969        54533       142.22
   56426.495     0.993750        54584       160.00
   56524.799     0.994531        54635       182.86
   56590.335     0.995313        54667       213.33
   56655.871     0.996094        54704       256.00
   56754.175     0.996484        54731       284.44
   56819.711     0.996875        54754       320.00
   56885.247     0.997266        54767       365.71
   56983.551     0.997656        54796       426.67
   57049.087     0.998047        54816       512.00
   57081.855     0.998242        54826       568.89
   57114.623     0.998437        54833       640.00
   57180.159     0.998633        54847       731.43
   57212.927     0.998828        54854       853.33
   57278.463     0.999023        54868      1024.00
   57311.231     0.999121        54876      1137.78
   57311.231     0.999219        54876      1280.00
   57343.999     0.999316        54884      1462.86
   57376.767     0.999414        54896      1706.67
   57376.767     0.999512        54896      2048.00
   57376.767     0.999561        54896      2275.56
   57376.767     0.999609        54896      2560.00
   57409.535     0.999658        54904      2925.71
   57409.535     0.999707        54904      3413.33
   57409.535     0.999756        54904      4096.00
   57442.303     0.999780        54908      4551.11
   57442.303     0.999805        54908      5120.00
   57442.303     0.999829        54908      5851.43
   57475.071     0.999854        54917      6826.67
   57475.071     1.000000        54917          inf
#[Mean    =    31215.550, StdDeviation   =    12344.102]
#[Max     =    57442.304, Total count    =        54917]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  65325 requests in 1.00m, 27.03MB read
Requests/sec:   1088.67
Transfer/sec:    461.36KB